clc,clear;
syms a b;
c=[a b]';
A=[250, 2400, 4900, 5150, 5500, 6892, 6457, 7579, 7785, 9834, 10045, 11532, 11603, 17478, 14820, 14402, 24821, 22200, 25000, 22000, 26152, 29862]
%A=[89677,99215,109655,120333,135823,159878,182321,209407,246619,300670];
B=cumsum(A);  %原始数据累加
n=length(A);
for i=1:(n-1)
    C(i)=(B(i)+B(i+1))/2; %生成累加矩阵
end
%计算待定参数的值
D=A;D(1)=[];
D=D';
E=[-C;ones(1,n-1)];
c=inv(E*E')*E*D;
c=c';
a=c(1);b=c(2);
%预测后续数据
F=[];F(1)=A(1);
for i=2:(n+10)  %只推测后10个数据，可以从此修改
    F(i)=(A(1)-b/a)/exp(a*(i-1))+b/a;
end
G=[];G(1)=A(1);
for i=2:(n+10)  %只推测后10个数据，可以从此修改
    G(i)=F(i)-F(i-1);  %得到预测出来的数据
end
t1=1:22;
t2=1:32;  %多10组数据
G
h=plot(t1,A,'o',t2,G,'-'); %原始数据与预测数据的比较
set(h,'LineWidth',1.5);    